FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ВнешниеПечатныеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВнешниеПечатныеФормы</Name>
			<Comment>Внешние печатные формы</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Comment>Идентификатор объекта из которого печатается данная форма</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКВнешнемуФайлу</Name>
					<Comment>Для варианта внешней печатной формы, хранящейся в виде внешней обработки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Comment>Для обработки, хранящейся в самой конфигурации</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьВоВнешнемФайле</Name>
					<Comment>Хранить во внешнем файле</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФормы</Name>
					<Comment>Версия формы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбработки</Name>
					<Comment>Вид обработки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВнешнихОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляВсехДокументов</Name>
					<Comment>Для всех документов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Принадлежность</Name>
					<Comment>Таблица принадлежностей</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОбъекта</Name>
							<Comment>Представление объекта</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТабличнойЧастиПредставление</Name>
							<Comment>Имя табличной части</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяОбъекта</Name>
							<Comment>Имя объекта</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТабличнойЧасти</Name>
							<Comment>Имя табличной части</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиПостроителяОтбор</Name>
							<Comment>Настройки построителя отбор</Comment>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОтбораПостроителя</Name>
							<Comment>Представление отбора построителя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/ВидыВнешнихОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыВнешнихОбработок</Name>
			<Comment>Виды внешних обработок</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
					<Comment>Отчет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
					<Comment>Обработка</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяФорма</Name>
					<Comment>Печатная форма</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнениеТабличнойЧасти</Name>
					<Comment>Заполнение табличной части</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШаблонПечатнойФормы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ВнешниеПечатныеФормы/Ext/ManagerModule.bsl
// Заполняет предопределенные элементы(если они не существуют - создает новые(не предопределенные!))
// при обновлении релиза
// Флаг ЗаполнятьВсе=Истина - перезаполняет уже существующие элементы(строгое заполнение)
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	
	Принадлежность = Новый СписокЗначений;
	Принадлежность.Добавить("Документ."+Метаданные.Документы.ЗаказНаряд.Имя,"Документ """+Метаданные.Документы.ЗаказНаряд.Синоним+"""");
	
	ЗаполнитьЭлемент(ЗаполнятьВсе,
					 "ЗаказНарядДоговор", //Имя заполняемой номенклатуры
					 "6", //Код заполняемой номенклатуры
					 Перечисления.ВидыВнешнихОбработок.ШаблонПечатнойФормы, //Вид обработки заполняемой номенклатуры
					 Ложь, //Способ хранения печ.формы заполняемой номенклатуры
					 Документы.ЗаказНаряд.ПолучитьМакет("ДоговорЗаказНарядШаблон"), //Макет печ.формы заполняемой номенклатуры
					 Принадлежность); //Принадлежность заполняемой номенклатуры
					 
	Принадлежность = Новый СписокЗначений;
	Принадлежность.Добавить("Документ."+Метаданные.Документы.ЗаказНаАвтомобиль.Имя,"Документ """+Метаданные.Документы.ЗаказНаАвтомобиль.Синоним+"""");
					 
	ЗаполнитьЭлемент(ЗаполнятьВсе,
					 "ЗаказНаАвтомобильДоговорПродажи", //Имя заполняемой номенклатуры
					 "7", //Код заполняемой номенклатуры
					 Перечисления.ВидыВнешнихОбработок.ШаблонПечатнойФормы, //Вид обработки заполняемой номенклатуры
					 Ложь, //Способ хранения печ.формы заполняемой номенклатуры
					 Документы.ЗаказНаАвтомобиль.ПолучитьМакет("ДоговорПродажиШаблон"), //Макет печ.формы заполняемой номенклатуры
					 Принадлежность); //Принадлежность заполняемой номенклатуры
					 
	Принадлежность = Новый СписокЗначений;
	Принадлежность.Добавить("Документ."+Метаданные.Документы.ЗаявкаНаХранениеШин.Имя,"Документ """+Метаданные.Документы.ЗаявкаНаХранениеШин.Синоним+"""");
					 
	ЗаполнитьЭлемент(ЗаполнятьВсе,
					 "ДоговорХраненияШин", //Имя заполняемой номенклатуры
					 "8", //Код заполняемой номенклатуры
					 Перечисления.ВидыВнешнихОбработок.ШаблонПечатнойФормы, //Вид обработки заполняемой номенклатуры
					 Ложь, //Способ хранения печ.формы заполняемой номенклатуры
					 Документы.ЗаявкаНаХранениеШин.ПолучитьМакет("ДоговорХраненияШаблон"), //Макет печ.формы заполняемой номенклатуры
					 Принадлежность); //Принадлежность заполняемой номенклатуры
					 
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()

// процедура заполнения элемента справочника
//
// Параметры:
//
// ЗаполнятьВсе 				-  Булево 				- Признак заполнения всех реквизитов элемента справочника
// НовоеНаименование 			- Строка				- Имя заполняемой номенклатуры
// НовыйКод 					- Строка 				- Код заполняемой номенклатуры
// НовыйТипНоменклатуры 		- СправочникСсылка 		- Тип заполняемой номенклатуры
// НовыйВидНоменклатуры 		- ПеречислениеСсылка 	- Вид заполняемой номенклатуры
// НоваяБазоваяЕдиницаИзмерения - СправочникСсылка 		- Базовая единица измерения заполняемой номенклатуры
// НоваяСтавкаНДС 				- СправочникСсылка		- Ставка НДС заполняемой номенклатуры
// ВесЕИ 						- Число 				- Вес единицы измерения
// ТочностьЕИ 					- Число					- Точность единицы измерения
//
Процедура ЗаполнитьЭлемент(ЗаполнятьВсе, НовоеНаименование, НовыйКод, НовыйВидОбработки, НовыйСпособХранения,
						   НовыйМакет, НоваяПринадлежность)
						   
	Попытка
		ЭлементСправочника = Справочники.ВнешниеПечатныеФормы[НовоеНаименование];
	Исключение
		ЭлементСправочника = Справочники.ВнешниеПечатныеФормы.ПустаяСсылка();
	КонецПопытки;
	Если ЭлементСправочника.Пустая() Тогда
		ЭлементСправочника = Справочники.ВнешниеПечатныеФормы.СоздатьЭлемент();
	Иначе
		ЭлементСправочника = ЭлементСправочника.ПолучитьОбъект();
	КонецЕсли;	
	Если ЗаполнятьВсе Тогда
		ЭлементСправочника.УстановитьНовыйКод();
		Если НовыйВидОбработки = Перечисления.ВидыВнешнихОбработок.ШаблонПечатнойФормы Тогда
			ЭлементСправочника.Родитель = Справочники.ВнешниеПечатныеФормы.ВнешниеШаблоныПечатныхФорм;
		КонецЕсли;
		ЭлементСправочника.Наименование = НовоеНаименование;
		ЭлементСправочника.ВидОбработки = НовыйВидОбработки;
		ЭлементСправочника.ХранитьВоВнешнемФайле = НовыйСпособХранения;
		ЭлементСправочника.Хранилище = Новый ХранилищеЗначения(НовыйМакет);
		ЭлементСправочника.Принадлежность.Очистить();
		Для Каждого ТекСтрока Из НоваяПринадлежность Цикл
			НоваяСтрокаТЧ = ЭлементСправочника.Принадлежность.Добавить();
			НоваяСтрокаТЧ.ИмяОбъекта = ТекСтрока.Значение;
			НоваяСтрокаТЧ.ПредставлениеОбъекта = ТекСтрока.Представление;
		КонецЦикла
	Иначе
		Если обЗначениеНеЗаполнено(ЭлементСправочника.Код) Тогда
			ЭлементСправочника.УстановитьНовыйКод();
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ЭлементСправочника.Наименование) Тогда
			ЭлементСправочника.Наименование = НовоеНаименование;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ЭлементСправочника.Родитель) Тогда
			Если НовыйВидОбработки = Перечисления.ВидыВнешнихОбработок.ШаблонПечатнойФормы Тогда
				ЭлементСправочника.Родитель = Справочники.ВнешниеПечатныеФормы.ВнешниеШаблоныПечатныхФорм;
			КонецЕсли;
	 	КонецЕсли;
		Если обЗначениеНеЗаполнено(ЭлементСправочника.ВидОбработки) Тогда
			ЭлементСправочника.ВидОбработки = НовыйВидОбработки;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ЭлементСправочника.ХранитьВоВнешнемФайле) Тогда
			ЭлементСправочника.ХранитьВоВнешнемФайле = НовыйСпособХранения;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ЭлементСправочника.Хранилище) Тогда
			ЭлементСправочника.Хранилище = Новый ХранилищеЗначения(НовыйМакет);
		КонецЕсли;
		Если ТипЗнч(ЭлементСправочника.Хранилище) = Тип("ХранилищеЗначения") Тогда
			Если обЗначениеНеЗаполнено(ЭлементСправочника.Хранилище.Получить()) Тогда
				ЭлементСправочника.Хранилище = Новый ХранилищеЗначения(НовыйМакет);
			КонецЕсли;
		КонецЕсли;
		Для Каждого ТекСтрока Из НоваяПринадлежность Цикл
			Если ЭлементСправочника.Принадлежность.Найти(ТекСтрока.Значение,"ИмяОбъекта")=Неопределено Тогда
				НоваяСтрокаТЧ = ЭлементСправочника.Принадлежность.Добавить();
				НоваяСтрокаТЧ.ИмяОбъекта = ТекСтрока.Значение;
				НоваяСтрокаТЧ.ПредставлениеОбъекта = ТекСтрока.Представление;
			КонецЕсли;
		КонецЦикла
		
	КонецЕсли;
	//сохранение элемента
	Если ЭлементСправочника.Модифицированность() Тогда
		Попытка
			ЭлементСправочника.Записать();
			Сообщить("Справочник ""Внешние печатные формы"". "+?(ЭлементСправочника.ЭтоНовый(),"Добавлен","Обновлен")+" элемент """+СокрЛП(ЭлементСправочника.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры // ЗаполнитьЭлемент()
